#  <font color=green>Data Wrangling</font>

### Table of Contents 
- 1. [Reading Data from different type of files](#section1)</br>
- 2. [Select Series from Dataframe](#section2)</br>
- 3. [Common Methods](#section3)</br>
- 4. [Profilling](#section4)</br>
- 5. [Renaming Column Names](#section5)</br>
- 6. [Removing columns or rows from DataFrame](#section6)</br>
- 7. [Sort Dataframe and Series](#section7)</br>
- 8. [Filter Records from Dataframe](#section8)</br>
- 9. [Iterating Series or Dataframe](#section9)</br>
- 10. [String Methods and regex](#section10)</br>
- 11. [Handle Missing values](#section11)</br>
- 12. [Date and Time Series](#section12)</br>

In [3]:
# Importing pandas
import pandas as pd

In [ ]:
# Display all the columns with horizontal scroll
pd.set_option('display.max_columns', 100) 

# now read the file with columns names upto 100 using pd.read_csv or pd.read_table

In [42]:
# Reading USER csv file with Pipe separated
usersUrl='http://bit.ly/movieusers'
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
user=pd.read_table(usersUrl,sep='|',header=None,names=user_cols)
user.head(2)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043

In [132]:
# Reading a subset of USER csv using usecols
usersUrl='http://bit.ly/movieusers'
user_cols_subset = ['user_id', 'gender', 'occupation']
user_subset=pd.read_table(usersUrl,sep='|',header=None,names=user_cols, usecols=user_cols_subset)
user_subset.head(2)

   user_id gender  occupation
0        1      M  technician
1        2      F       other

In [133]:
# Reading a subset with position of columns
col_position=[1,2,4]
user_subset1=pd.read_csv(usersUrl,sep='|',header=None,names=user_cols, usecols=col_position)
user_subset1.head(2)

   age gender zip_code
0   24      M    85711
1   53      F    94043

In [8]:
# Reading UFO csv file with , separated
ufoUrl='http://bit.ly/uforeports'
ufo=pd.read_table(ufoUrl,sep=',')
ufo.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [9]:
# Reading MOVIES csv file
moviesUrl='http://bit.ly/imdbratings'
movies=pd.read_csv(moviesUrl)
movies.head(2)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"

In [10]:
# Reading ORDERS csv file with tab separated
ordersUrl='http://bit.ly/chiporders'
orders=pd.read_table(ordersUrl)
orders.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [11]:
# Reading DRINKS csv file
drinksUrl='http://bit.ly/drinksbycountry'
drinks=pd.read_csv(drinksUrl)
drinks.head(2)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe

In [12]:
# Rading TITANIC csv file
titanicUrl='http://bit.ly/kaggletrain'
titanic=pd.read_csv(titanicUrl)
titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [247]:
# Reading Flight Data set from text file with TAB as separater
flight=pd.read_csv('https://raw.githubusercontent.com/rohitchouhan1119/DataScience/master/Data/FlightsData.txt',sep='\t')
flight.head(3)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882

<a id=section2></a> 
## <font color=blue>2.Select Series from Dataframe</font>

- Each column in Dataframe is a series.
- 1st Method is not used when we have space in column names
- column name is case sensitive when selecting a series from dataframe
- we can combine or concatinate series object of same type like object-object

In [15]:
# Method #1
user.age

# Method #2
user['age']

In [22]:
# Create a new column from dataframe using series
user['Gender-Occupation']= user.gender + '-' + user.occupation

<a id=section3></a>
## <font color=blue>3. Common Methods</font>

In [25]:
# show the shape of dataframe
user.shape

In [ ]:
# show the descriptive statistic fo numerical data
user.describe()
# show statistic of all column
user.describe(include='all')

In [ ]:
# show the Data Type of all column
user.dtypes

In [28]:
# show the column names of a dataframe
user.columns

In [ ]:
#show top and botton rows of dataset
user.head(5)
user.tail(5)

In [ ]:
# show the count of each item in a column
user['age'].value_counts()

In [ ]:
# show the type and count of null value in all columns
user.info()

In [ ]:
# show the correlation of numerical columns
user.corr()

In [ ]:
# display random sample of 10 rows from dataset
user.sample(10)

In [ ]:
# show the sum of null values in eacch columns
user.isnull().sum()

In [170]:
# change the type of column
drinks['beer_servings']=drinks.beer_servings.astype(float)

In [ ]:
# show the unique values in a column
movies.genre.unique()

In [ ]:
# show the count of unique values in a column
movies.genre.nunique()

<a id=section4></a>
## <font color=blue>4. Profilling</font>

In [ ]:
# pre-profilling
preprofile = pandas_profiling.ProfileReport(user)
preprofile.to_file(outputfile="user_before_processing.html")

In [ ]:
# post-profilling
postprofile = pandas_profiling.ProfileReport(user)
postprofile.to_file(outputfile="user_after_processing.html")

<a id=section5></a>
## <font color=blue>5. Renaming Column Names</font>

- inplace=True is used to make the changes in the Dataframe

In [32]:
# Rename one or two column names
user.rename(columns={'age':'Age','gender':'Gender'}, inplace=True)

In [39]:
# Rename multiple or all the columns
user_cols=['User_Id','Age','Gender','Occupation','Zip_Code']
user.columns=user_cols

In [70]:
# Rename columns while reading or changing columns names
user_col=['User Id','Age','Gender','Occupation','Zip Code']
userUrl='http://bit.ly/movieusers'
user=pd.read_csv(userUrl, names=user_col,sep='|')

In [63]:
# Replacing spaces with underscore in columns
user.columns=user.columns.str.replace(' ','_')

<a id=section6></a>
## <font color=blue>6. Removing columns or rows from DataFrame</font>

- axis=0            It will remove rows from data frame
- axis=1            It will remove columns from data frame
- inplace=True      It will affect the data frame

In [71]:
# Remove one column
user.drop('Age',inplace=True,axis=1)

In [54]:
# Remove multiple columns
col_drop_list=['User_Id','Gender','Occupation']
user.drop(col_drop_list,inplace=True,axis=1)
# OR
user.drop(['Gender','Occupation'],axis=1,inplace=True)

In [59]:
# remove rows 0 and 1
rows=[0,1]
user.drop(rows,axis=0,inplace=True)

<a id=section7></a>
## <font color=blue>7. Sort Dataframe and Series</font>

- Sorting is done with numbers first and then with alphanumeric

In [77]:
# Sort values of a column
movies.title.sort_values()
        # OR
movies['title'].sort_values()

In [79]:
# sort dataframe with one columns
movies.sort_values('title')

In [83]:
# Sort dataframe with decending rating
movies.sort_values('star_rating', ascending=False)
    # OR
movies.sort_values(by='star_rating', ascending=False)

# Sort Dataframe with ascending rating
movies.sort_values('star_rating',ascending=True)

In [86]:
# Sort dataframe with 2 columns
movies.sort_values(['star_rating','duration'],ascending=True)
    # OR
movies.sort_values(by=['star_rating','duration'],ascending=True)

In [88]:
# Sort ascending with one column and decending with other column
movies.sort_values(['star_rating','duration'],ascending=[True,False])
    # OR
movies.sort_values(by=['star_rating','duration'],ascending=[True,False])

<a id=section8></a>
## <font color=blue>8. Filter records from dataframe</font>

- **.loc** is used to filter with column names of dataset
- **.iloc** is used to filter with index of dataset

In [92]:
# Filter records where duration >=200
movies[movies.duration >=200]
    # OR
movies[movies['duration']>=200]

# Filter column where duration >=200
movies[movies.duration >=200]['star_rating']
    # OR
movies[movies.duration >=200].star_rating

In [95]:
# Best Way to filter records
movies.loc[movies.duration>=200,'star_rating']
    # OR
movies.loc[movies.duration>=200]

In [110]:
# Filter records based on index 

# return 1-4 rows and first columns
movies.iloc[1:5,1:2]

# return 1-10 rows and all columns
movies.iloc[1:11,:]

# return 0-7 rows and start to 3 columns
movies.iloc[:8,:3]

# return last columns
movies.iloc[:5,-1:]

# return last 2 columns
movies.iloc[:5,-2:]

In [117]:
#Filter records based on column names

# return duration column
movies.loc[:,'duration']

# return columns upto duration
movies.loc[:,:'duration']

# return columns between title and genre
movies.loc[:,'title':'genre']

In [121]:
# filter dataframe with multiple condition                                  SLOW FILTERING

# AND CONDITION
movies[(movies.duration>=200) & (movies.genre=='Crime')]
# OR CONDITION
movies[(movies.duration>=200) | (movies.genre=='Crime')]

# filter dataframe for 2 genre i.e. Crime and Adventure                     FAST FILTERING
movies[movies.genre.isin(['Crime','Adventure'])]

<a id=section9></a>
## <font color=blue> 9. Iterating Series or Dataframe</font>

In [ ]:
# iterate through a column
for genre in movies.genre:
    print(genre)

In [ ]:
# iterate through all rows and get index and row
for index,row in movies.iterrows():
    print(index,row.title,row,duration)

In [154]:
# iterate through 5 rows and get index and row
for index,row in movies.head().iterrows():
    print(index,row)
    # OR
for index,row in movies.iterrows():
    print(index,row['duration'],row['star_rating'])
    # OR
for index,row in movies.iterrows():
    print(index,row[0],row[1],row[2])

In [ ]:
# iterate through rows using itertuples function
for row in movies.itertuples():
    print(row.Index,row.duration,row.star_rating)

In [145]:
# iterate over rows and get all values of columns as series using iteritems function
for key,value in movies.iteritems():
    print(key, value)

In [151]:
# iterating over columns and display 3 row
col=list(movies)
for i in col:
    print(movies[i][2])

<a id=section10></a>
## <font color=blue>10. String Methods</font>
- [] -> set of character
- *****  -> zero or more occurances
- **+**  -> one or more occurances
- **.**  -> Any character except new line character
- {} -> exactly specified occurances
- ^  -> starts with     , $  -> ends with
- [arn]  -> Returns a match where one of the specified characters (a, r, or n) are present
- [^arn] -> Returns a match for any character EXCEPT a, r, and n
- [0-5][0-9]  -> Returns a match for any two-digit numbers from 00 and 59
- \  -> for special charater we use this eg to remove [] regex is " [ \ [ \ ] ]"
-
-
-

In [158]:
# check substring is present in column
movies[movies.actors_list.str.contains('Marlon Brando')]

In [160]:
# use of replace method
movies.actors_list.str.replace(',','|')

In [164]:
# use of extract method - extract first name
titanic.Name.str.extract('([A-za-z]+)', expand=False)

In [167]:
# use of Split Method - get the last word of title
movies.title.str.split().str.get(-1)
# get second last word
movies.title.str.split().str.get(-2)
# get the slice of text
movies.title.str[0:3]

<a id=section11></a>
## <font color=blue>11. Handle Missing Value</font>

In [ ]:
# drop rows if any column has Missing or NAN value
movies.dropna(how='any')

# drop rows if all column have missing or NaN value
movies.dropna(how='all')

# dropw rows if column star_rating or duration have missing or NaN value
movies.dropna(subset=['star_rating','duration'], how='any')

# dropw rows if column star_rating and duration have missing or NaN value
movies.dropna(subset=['star_rating','duration'], how='all')

# Fill NaN with some value like abc
movies['star_rating'].fillna(value='abc', inplace=True)

<a id=section12></a>
## <font color=blue>12. Date and Time Series</font>

- to_datetime function works when hours lies in 0-24, minute lies in 0-60 and seconds lies in 0-60
- Timestamp is used for comparision of date and to perform some date operation
- date2 = date1 + timedelta
- datetime2 = datetime1 + timedelta
- to_timedelta() is used to convert OBJECT TYPE TO TIMEDELTA TYPE
- to_datetime() is used to convert OBJECT TYPE TO DATETIME TYPE
- datetime.combine(date,time) is used to combine date and time

In [339]:
from datetime import datetime
from datetime import timedelta

In [477]:
flight=pd.read_csv('https://raw.githubusercontent.com/rohitchouhan1119/DataScience/master/Data/FlightsData.txt',sep='\t')
flight.head(3)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882

In [ ]:
import Timestamp
# Get the No of SECONDS from any DATETIME from 01-01-1970
unix-epoch=timestamp(start_datetime)       # it will no of seconds

In [ ]:
# Get the DATETIME from no of SECONDS
start_datetime=fromtimestamp(1457403760)    # it will give the date and time

In [ ]:
#convert Duration to timedelta
flight

In [ ]:
from datetime import datetime, timedelta
# we specify the input and the format...
t = datetime.strptime("05:20:25","%H:%M:%S")
# ...and use datetime's hour, min and sec properties to build a timedelta
delta = timedelta(hours=t.hour, minutes=t.minute, seconds=t.second)

In [358]:
# Convert string to datetime object
date_str = "17:53"
time_tuple = time.strptime(date_str, "%H:%M")
print(time_tuple)
print(time_tuple.tm_mday)

time.struct_time(tm_year=1900, tm_mon=1, tm_mday=1, tm_hour=17, tm_min=53, tm_sec=0, tm_wday=0, tm_yday=1, tm_isdst=-1)
1

In [176]:
# convert time column from object to DATETIME type
ufo.Time=pd.to_datetime(ufo.Time)

# convert time column to DATETIME with formate HH:MM:SS
ufo.Time=pd.to_datetime(ufo.Time, format='%H:%M:%S')

In [ ]:
# perform conditional operation on time
# records before 9AM
timestamp=pd.to_datetime("09:00:00",format='%H:%M:%S')
ufo[ufo.Time<timestamp]

In [ ]:
# perform conditional operation on Date
# records before 1/1/2005
datestamp=pd.to_datetime("01/01/200d",format='%d/%m/%y')
ufo[ufo.Date<datestamp]

In [178]:
# get the hours or minute or weekday_name or weekday or day_of_the_year from DATETIME Column TYPE
ufo.Time.dt.hour.head()
ufo.Time.dt.minute.head()
ufo.Time.dt.weekday_name.head()
ufo.Time.dt.weekday.head()
ufo.Time.dt.dayofyear.head()

In [ ]:
# Add one day in datetime object
datetime2=datetime1+timedelta(days=1)

# Add 15 minutes in datetime object
datetime2=datetime1+timedelta(minutes=15)

In [174]:
# Get hours from time column as Interger value when column is OBJECT TYPE
ufo.Time.str.slice(-5,-3).astype(int).head(3)

In [180]:
# Create a TIMESTAMP for 1st jan 2000
ts=pd.to_datetime('1/1/2000')

In [182]:
# Filter records whose date and time is after 1st Jan 2000
ufo.loc[ufo.Time > ts,]

In [193]:
# When TIme column TYPE IS DATETIME

# Find the max date in Time coumn 
ufo.Time.max()
# Find the Min date in Time Column
ufo.Time.min()
# Find the difference in Max and Min date
ufo.Time.max() - ufo.Time.min()
# Find the DIfference of days in Max and Min dateTime
(ufo.Time.max()-ufo.Time.min()).days

In [ ]:
# Convert Object to TIMEDELTA TYPE
flight['Dep_TIme']=pd.to_timedelta(flight.Dep_Time)

# Get days from timedelta Series object
flight['Dep_Time'].dt.days()

# Get seconds from timedelta Series object
flight['Dep_Time'].dt.seconds()

# get minutes from timedelta series onject
(flight['Dep_Time'].dt.seconds()/60)

# get hours from timedelta series onject
(flight['Dep_Time'].dt.seconds()/3600)

# get hours from timedelta series onject
(flight['Dep_Time'].dt.days()*24)

In [351]:
# combine 2 object column into DATETIME
from datetime import datetime
from datetime import timedelta

# convert series to DATETIME and time column will take default date
flight['Date_of_Journey']=pd.to_datetime(flight.Date_of_Journey)
flight['Dep_Time']=pd.to_datetime(flight.Dep_Time)

# get the date from DATETIME OBJECT
flight['Dep_Time'].apply(lambda x:x.date())

# Convert DATETIME object to TIMEDELTA object
flight.Dep_Time=pd.to_timedelta(flight.Dep_Time)

# get the seconds value from Dep_Time
flight['depTime']=flight['Dep_Time'].dt.seconds

#Convert seconds into TIMEDELTA
flight['depTime']=flight.depTime.apply(lambda x:timedelta(seconds=x))

# New column after combining date column as object and time column as object
flight['Journey_Dep_Time']=flight['Date_of_Journey']+flight['depTime']

<a id=section13></a>
## <font color=blue>13. Random Functions</font>

In [ ]:
def parse_time(time_str):
    t=datetime.strptime(time_str,'%H:%M')
    delta=timedelta(hours=t.hour,minutes=t.minute)
    return delta

In [478]:
def append_00(s):
    '''
    This function takes a string and if its length is less than or equal to 3 then it appends 00m
    in the string else no changes are done to the string.
    '''
    if(len(s)<=3):
        s=s+' 00m'
    return s

In [480]:
#flight['new_duration']=flight['Duration'].apply(append_00)
#flight[['Duration','new_duration']]

In [383]:
def pad_0(s):
    '''
    This function takes string and split it with space. If length is less then 3 then it pads 0 
    else original string remains same    
    '''
    s1=s.split(' ')
    if (len(s1[0])<3):
        s1[0]='0'+s1[0]
    if (len(s1[1])<3):
        s1[1]='0'+s1[1]
    return s1[0]+s1[1]

In [387]:
#flight['new_duration']=flight['new_duration'].apply(pad_0)
#flight[['Duration','new_duration']]

In [481]:
s='0500'
s=s.replace('h','').replace('m','')
s1=s.split(':')
if s1[0]!='':
    s1[0]=int(s1[0])*3600
if s1[1]!='':
    s1[1]=int(s1[1])*60
print(s1[0]+s1[1])

IndexError: list index out of range

In [473]:
def parse_time_to_second(s):
    '''
    This function accepts string and convert it to seconds
    '''
    s=s.replace('h','').replace('m','')
    s1=s.split(':')
    print(s1[0],s1[1])
    s1[0]=int(s1[0])*3600
    s1[1]=int(s1[1])*60
    return s1[0]+s1[1]

In [482]:
# Get the record where length of value is less then 5
flight[flight['new_duration'].apply(lambda x: len(x))<5]

In [475]:
flight['new_duration']=flight['new_duration'].apply(parse_time_to_second)

In [395]:
flight.new_duration=flight.new_duration.str.replace('h',':').str.replace('m','')

In [401]:
# convert 
#flight['new_duration']=pd.to_datetime(flight.new_duration)
#flight['latest_duration']=pd.to_timedelta(flight.new_duration)

In [400]:
#flight['new_duration'].unique()

In [ ]:
# Convert more than 24 hours to datetime or time delta
#TODO

Arithematic Operations

In [ ]:
#Q add bronze and silver medal of olympic

bronze.add(silver, fill_value=0) # it will add values of silver and bronze and replacing nan with 0

#Q add bronze, silver and gold
bronze.add(silver, fill_value=0).add(gold, fill_value=0)

#Q find difference and then divide by third
df_new[['Gold','Gold.1']].max(1).divide(df_new['Gold.2'], axis='rows')

In [ ]:
#Q convert 2 colum of dataframe into dataframe

df=pd.DataFrame(np.array(df1[['column1','column2']]))

In [ ]:
#Q read data from online webpage

list_of_df = pd.read_html('url of web page') # all dataframe will be under square brackets
print(list_of_df) # this is a list
print(list_of_df[0]) # this is a dataframe
print(list_of_df[0][0]) # this is a column

for abbv in list_of_df[0][0][1:]:
    print("FMAC/HPI_"+str(abbv))

In [ ]:
#Q Concatenating and Appending Dataframe
# df1 and df3 have same index and one different column
# df1 and df2 have same column and different index

df1 = pd.DataFrame({'HPI':[80,85,88,85],
                   'Int_rate':[2,3,2,2],
                   'US_GDP_Thousand':[50,55,65,55]},
                  index = [2001,2002,2003,2004])

df2 = pd.DataFrame({'HPI':[80,85,88,85],
                   'Int_rate':[2,3,2,2],
                   'US_GDP_Thousand':[50,55,65,55]},
                  index = [2005,2006,2007,2008])

df3 = pd.DataFrame({'HPI':[80,85,88,85],
                   'Int_rate':[2,3,2,2],
                   'Low_tier_HPI':[50,55,65,55]},
                  index = [2001,2002,2003,2004])
# all are incorrect way of doing it
concat1 = pd.concat(df1,df2)
concat2 = pd.concat(df1,df2,df3)
df4 = df1.append(df2)
df5 = df1.append(df3)

# correct way super efficient
s = pd.Series([80,2,50], index=['HPI', 'Int_rate','US_GDP_Thousand'])
df6= df1.append(s, ignore_index=True)

In [ ]:
# Resampleing: ohlc - open-high-low-closed

TX1Yr = HPI_data['TX'].resample('A', how = 'mean')
TXDaily = HPI_data['TX'].resample('D', how = 'ohlc')
TXHourly = HPI_data['TX'].resample('H', how = 'mean')

In [ ]:
# Handling Missing Data - Ignore or remove or fill or replace

# drop all rows which have missing data
df.dropna(inplace=True)

# drop row which have all data is missing
df.dropna(how='all', inplace=True)

# drop row which have a specific count of data is missing lets say 2 Nan
df.dropna(thresh=2, inplace=True)


# Fill missing data
df.fillna(method='ffill',inplace=True)
df.fillna(method='bfill',inplace=True)

# Fill with value 9999
df.fillna(value=9999, inplace=True)

Merging Dataframe

In [1]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store 1', 'Store 1', 'Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

In [2]:
df['Date'] = ['December 1', 'January 1', 'mid-May']
df

         Cost Item Purchased   Name        Date
Store 1  22.5         Sponge  Chris  December 1
Store 1   2.5   Kitty Litter  Kevyn   January 1
Store 2   5.0          Spoon  Filip     mid-May

In [3]:
df['Delivered'] = True
df

         Cost Item Purchased   Name        Date  Delivered
Store 1  22.5         Sponge  Chris  December 1       True
Store 1   2.5   Kitty Litter  Kevyn   January 1       True
Store 2   5.0          Spoon  Filip     mid-May       True

In [4]:
df['Feedback'] = ['Positive', None, 'Negative']
df

         Cost Item Purchased   Name        Date  Delivered  Feedback
Store 1  22.5         Sponge  Chris  December 1       True  Positive
Store 1   2.5   Kitty Litter  Kevyn   January 1       True      None
Store 2   5.0          Spoon  Filip     mid-May       True  Negative

In [5]:
adf = df.reset_index()
adf['Date'] = pd.Series({0: 'December 1', 2: 'mid-May'})
adf

     index  Cost Item Purchased   Name        Date  Delivered  Feedback
0  Store 1  22.5         Sponge  Chris  December 1       True  Positive
1  Store 1   2.5   Kitty Litter  Kevyn         NaN       True      None
2  Store 2   5.0          Spoon  Filip     mid-May       True  Negative

In [6]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df.head())
print()
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [7]:
# merge based on index
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [8]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [ ]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

In [ ]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

In [9]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
# merge based on column
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business

In [10]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
# merge based on column and when both df have same column so left will always be _x
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

          Location_x   Name            Role            Location_y       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liasion   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [11]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])
staff_df
student_df
# merge based on 2 column names
pd.merge(staff_df, student_df, how='inner', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

In [20]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
# merge based on index and column
pd.merge(staff_df, student_df, how='inner', left_index=True, right_on='Name')

             Role   Name       School
2  Course liasion  Sally  Engineering
0          Grader  James     Business

# Idiomatic Pandas: Making Code Pandorable

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/rohitchouhan1119/DataScience/master/Data/census.csv')
df

In [ ]:
# Pandorable i.e. good chaining
(df.where(df['SUMLEV']==50)
    .dropna()
    .set_index(['STNAME','CTYNAME'])
    .rename(columns={'ESTIMATESBASE2010': 'Estimates Base 2010'}))

In [ ]:
df = df[df['SUMLEV']==50]
df.set_index(['STNAME','CTYNAME'], inplace=True)
df.rename(columns={'ESTIMATESBASE2010': 'Estimates Base 2010'})

In [ ]:
import numpy as np
# function to calculate the min and max of each row
def min_max(row):
    data = row[['POPESTIMATE2010',
                'POPESTIMATE2011',
                'POPESTIMATE2012',
                'POPESTIMATE2013',
                'POPESTIMATE2014',
                'POPESTIMATE2015']]
    return pd.Series({'min': np.min(data), 'max': np.max(data)})

In [ ]:
df.apply(min_max, axis=1)

In [ ]:
import numpy as np
# function to calculate the min and max of each row and create 2 column as min and max
def min_max(row):
    data = row[['POPESTIMATE2010',
                'POPESTIMATE2011',
                'POPESTIMATE2012',
                'POPESTIMATE2013',
                'POPESTIMATE2014',
                'POPESTIMATE2015']]
    row['max'] = np.max(data)
    row['min'] = np.min(data)
    return row
df.apply(min_max, axis=1)

In [ ]:
rows = ['POPESTIMATE2010',
        'POPESTIMATE2011',
        'POPESTIMATE2012',
        'POPESTIMATE2013',
        'POPESTIMATE2014',
        'POPESTIMATE2015']
df.apply(lambda x: np.max(x[rows]), axis=1)

In [ ]:
# modify the DataFrame df in one statement to drop any entries where 'Quantity' is 0 and 
    # rename the column 'Weight' to 'Weight (oz.)'?
df.drop(df[df['Quantity'] == 0].index).rename(columns={'Weight': 'Weight (oz.)'})

# Group by

In [ ]:
import pandas as pd
import numpy as np
df = pd.read_csv('https://raw.githubusercontent.com/rohitchouhan1119/DataScience/master/Data/census.csv')
df = df[df['SUMLEV']==50]
df

In [ ]:
%%timeit -n 10
for state in df['STNAME'].unique():
    avg = np.average(df.where(df['STNAME']==state).dropna()['CENSUS2010POP'])
    print('Counties in state ' + state + ' have an average population of ' + str(avg))

In [ ]:
%%timeit -n 10
# looping with group by is fast
for group, frame in df.groupby('STNAME'):
    avg = np.average(frame['CENSUS2010POP'])
    print('Counties in state ' + group + ' have an average population of ' + str(avg))

In [ ]:
df.head()

In [ ]:
df = df.set_index('STNAME')

def fun(item):
    if item[0]<'M':
        return 0
    if item[0]<'Q':
        return 1
    return 2
# passing funtion in group by
for group, frame in df.groupby(fun):
    print('There are ' + str(len(frame)) + ' records in group ' + str(group) + ' for processing.')

In [ ]:
df = pd.read_csv('census.csv')
df = df[df['SUMLEV']==50]

In [ ]:
df.groupby('STNAME').agg({'CENSUS2010POP': np.average})

In [ ]:
print(type(df.groupby(level=0)['POPESTIMATE2010','POPESTIMATE2011']))
print(type(df.groupby(level=0)['POPESTIMATE2010']))

In [ ]:
# correct way of grouping for series and giving name to aggregate column
(df.set_index('STNAME').groupby(level=0)['CENSUS2010POP']
    .agg({'avg': np.average, 'sum': np.sum}))

In [ ]:
# correct way of grouping for dataframe and giving name to aggregate column
(df.set_index('STNAME').groupby(level=0)['POPESTIMATE2010','POPESTIMATE2011']
    .agg({'avg': np.average, 'sum': np.sum}))

In [ ]:
# incorrect way of giving name to aggregate column as 'POPESTIMATE2010' and 'POPESTIMATE2011'
(df.set_index('STNAME').groupby(level=0)['POPESTIMATE2010','POPESTIMATE2011']
    .agg({'POPESTIMATE2010': np.average, 'POPESTIMATE2011': np.sum}))

Q  Looking at our backpacking equipment DataFrame, suppose we are interested in finding our 
total weight for each category. Use groupby to group the dataframe, and apply a function to calculate the total weight (Weight x Quantity) by category.

In [ ]:
 Dataframe : df
                        Category  Quantity  Weight (oz.)
Item                                                   
Pack                       Pack         1          33.0
Tent                    Shelter         1          80.0
Sleeping Pad              Sleep         1          27.0
Sleeping Bag              Sleep         1          20.0
Toothbrush/Toothpaste    Health         1           2.0
Sunscreen                Health         1           5.0
Medical Kit              Health         1           3.7
Spoon                   Kitchen         1           0.7
Stove                   Kitchen         1          20.0
Water Filter            Kitchen         1           1.8
Water Bottles           Kitchen         2          35.0
Pack Liner              Utility         1           1.0
Stuff Sack              Utility         1           1.0
Trekking Poles          Utility         1          16.0
Rain Poncho            Clothing         1           6.0
Shoes                  Clothing         1          12.0
Hat                    Clothing         1           2.5

In [ ]:
print(df.groupby('Category').apply(lambda df,a,b: sum(df[a] * df[b]), 'Weight (oz.)', 'Quantity'))


# Or alternatively without using a lambda:
# def totalweight(df, w, q):
#        return sum(df[w] * df[q])
#        
# print(df.groupby('Category').apply(totalweight, 'Weight (oz.)', 'Quantity'))

# Scales

In [ ]:
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'],
                  index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'])
df.rename(columns={0: 'Grades'}, inplace=True)
df

In [ ]:
df['Grades'].astype('category').head()

In [ ]:
# ordered=True is used to create the category in logical order and always use this 
grades = df['Grades'].astype('category',
                             categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'],
                             ordered=True)
grades.head()

In [ ]:
grades > 'C'

In [ ]:
# pd.cut is used to bin the data in multiple category lik ein this examle we created 10 bins
df = pd.read_csv('census.csv')
df = df[df['SUMLEV']==50]
df = df.set_index('STNAME').groupby(level=0)['CENSUS2010POP'].agg({'avg': np.average})
pd.cut(df['avg'],10)

Try casting this series to categorical with the ordering Low < Medium < High

In [4]:
s = pd.Series(['Low', 'Low', 'High', 'Medium', 'Low', 'High', 'Low'])
s.astype('category', categories=['Low', 'Medium', 'High'], ordered=True)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: specifying 'categories' or 'ordered' in .astype() is deprecated; pass a CategoricalDtype instead

0       Low
1       Low
2      High
3    Medium
4       Low
5      High
6       Low
dtype: category
Categories (3, object): [Low < Medium < High]

Suppose we have a series that holds height data for jacket wearers. Use pd.cut to bin this 
data into 3 bins.

In [ ]:
s = pd.Series([168, 180, 174, 190, 170, 185, 179, 181, 175, 169, 182, 177, 180, 171])


pd.cut(s, 3)

# You can also add labels for the sizes [Small < Medium < Large].
pd.cut(s, 3, labels=['Small', 'Medium', 'Large'])

# Pivot Tables

In [ ]:
#http://open.canada.ca/data/en/dataset/98f1a129-f628-4ce4-b24d-6f16bf24dd64
df = pd.read_csv('https://raw.githubusercontent.com/rohitchouhan1119/DataScience/master/Data/cars.csv')

In [ ]:
df.head()

In [ ]:
df.pivot_table(values='(kW)', index='YEAR', columns='Make', aggfunc=np.mean)

In [ ]:
df.pivot_table(values='(kW)', index='YEAR', columns='Make', aggfunc=[np.mean,np.min], margins=True)

Suppose we have a DataFrame with price and ratings for different bikes, broken down by manufacturer and type of bicycle.

Create a pivot table that shows the mean price and mean rating for every 'Manufacturer' / 'Bike Type' combination.

In [ ]:
   Bike Type Manufacturer  Price  Rating
0   Mountain            A    400       8
1   Mountain            A    600       9
2       Road            A    400       4
3       Road            A    450       4
4   Mountain            B    300       6
5   Mountain            B    250       5
6       Road            B    400       4
7       Road            B    500       6
8   Mountain            C    400       5
9   Mountain            C    500       6
10      Road            C    800       9
11      Road            C    950      10

In [ ]:
print(pd.pivot_table(Bikes, index=['Manufacturer','Bike Type']))

# Date Functionality in Pandas

In [2]:
import pandas as pd
import numpy as np

### Timestamp

In [3]:
pd.Timestamp('9/1/2016 10:05AM')

Timestamp('2016-09-01 10:05:00')

### Period

In [4]:
pd.Period('1/2016')

Period('2016-01', 'M')

In [5]:
pd.Period('3/5/2016')

Period('2016-03-05', 'D')

### DatetimeIndex

In [6]:
t1 = pd.Series(list('abc'), [pd.Timestamp('2016-09-01'), pd.Timestamp('2016-09-02'), pd.Timestamp('2016-09-03')])
t1

2016-09-01    a
2016-09-02    b
2016-09-03    c
dtype: object

In [7]:
type(t1.index)

pandas.tseries.index.DatetimeIndex

### PeriodIndex

In [8]:
t2 = pd.Series(list('def'), [pd.Period('2016-09'), pd.Period('2016-10'), pd.Period('2016-11')])
t2

2016-09    d
2016-10    e
2016-11    f
Freq: M, dtype: object

In [9]:
type(t2.index)

pandas.tseries.period.PeriodIndex

### Converting to Datetime

In [10]:
d1 = ['2 June 2013', 'Aug 29, 2014', '2015-06-26', '7/12/16']
ts3 = pd.DataFrame(np.random.randint(10, 100, (4,2)), index=d1, columns=list('ab'))
ts3

               a   b
2 June 2013   16  46
Aug 29, 2014  14  66
2015-06-26    59  99
7/12/16       27  17

In [11]:
ts3.index = pd.to_datetime(ts3.index)
ts3

             a   b
2013-06-02  16  46
2014-08-29  14  66
2015-06-26  59  99
2016-07-12  27  17

In [12]:
pd.to_datetime('4.7.12', dayfirst=True)

Timestamp('2012-07-04 00:00:00')

### Timedeltas

In [13]:
pd.Timestamp('9/3/2016')-pd.Timestamp('9/1/2016')

Timedelta('2 days 00:00:00')

In [14]:
pd.Timestamp('9/2/2016 8:10AM') + pd.Timedelta('12D 3H')

Timestamp('2016-09-14 11:10:00')

### Working with Dates in a Dataframe

In [15]:
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')
dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [16]:
df = pd.DataFrame({'Count 1': 100 + np.random.randint(-5, 10, 9).cumsum(),
                  'Count 2': 120 + np.random.randint(-5, 10, 9)}, index=dates)
df

            Count 1  Count 2
2016-10-02      104      125
2016-10-16      109      122
2016-10-30      111      127
2016-11-13      117      126
2016-11-27      114      126
2016-12-11      109      121
2016-12-25      105      126
2017-01-08      105      125
2017-01-22      101      123

In [17]:
df.index.weekday_name

array(['Sunday', 'Sunday', 'Sunday', 'Sunday', 'Sunday', 'Sunday',
       'Sunday', 'Sunday', 'Sunday'], dtype=object)

In [18]:
df.diff()

            Count 1  Count 2
2016-10-02      NaN      NaN
2016-10-16      5.0     -3.0
2016-10-30      2.0      5.0
2016-11-13      6.0     -1.0
2016-11-27     -3.0      0.0
2016-12-11     -5.0     -5.0
2016-12-25     -4.0      5.0
2017-01-08      0.0     -1.0
2017-01-22     -4.0     -2.0

In [19]:
df.resample('M').mean()

            Count 1     Count 2
2016-10-31    108.0  124.666667
2016-11-30    115.5  126.000000
2016-12-31    107.0  123.500000
2017-01-31    103.0  124.000000

In [20]:
df['2017']

            Count 1  Count 2
2017-01-08      105      125
2017-01-22      101      123

In [21]:
df['2016-12']

            Count 1  Count 2
2016-12-11      109      121
2016-12-25      105      126

In [22]:
df['2016-12':]

            Count 1  Count 2
2016-12-11      109      121
2016-12-25      105      126
2017-01-08      105      125
2017-01-22      101      123

In [ ]:
df.asfreq('W', method='ffill')

In [ ]:
import matplotlib.pyplot as plt
%matplotlib inline

df.plot()